#+BEGIN_COMMENT
.. title: Working with Trees - Json And XML Sytanx and Validation
.. slug: working-with-trees-json-and-xml-sytanx-and-validation
.. date: 2020-06-25 10:10:01 UTC+02:00
.. tags: Big Data
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT

#+begin_export html
<style>
img {
  display: block;
  margin-left: auto;
  margin-right: auto;
}
</style>
#+end_export

This posts goes over the syntax of XML and Json; two of the most
widely used formats for storing data in tree form. 

It also goes over the validation of the data in the two
formats. Recall that today other formats are more used in the Big Data
world. Think for instance at =parquet=. With a basic understanding of
the formats above it will however be easy for you to get on going with
the other formats.

{{{TEASER_END}}}

#+BEGIN_EXPORT html
<br>
<br>
#+END_EXPORT

** Json Validation

   Here I use the python's =jsonschema= package to validate json
   objects. Notice that other options are possible

   #+BEGIN_SRC python :session valdidate_json
import json                                                                    
from jsonschema import validate
#+END_SRC

#+RESULTS:

Next, you define the schema you want to apply to your json document.

#+BEGIN_SRC python :session valdidate_json
schema={'type': 'object', 
        'properties': {'target': {'type': 'string'},
                       'choices': {'type': 'array', 
                                   'items': {'type': 'string'}},\
                       'guess': {'type': 'string'}, 
                       'date': {'type': 'string'}, 
                       'country': {'type': 'string'}, 
                       'sample': {'type': 'string'}} ,\
        'required': ['target', 'choices', 
                     'date', 'country', 'sample']
}
#+END_SRC

#+RESULTS:

Define an array of JSON objects to validate; i.e. your json document.

#+BEGIN_SRC python :session valdidate_json :results output
Records=[{'guess': 'Norwegian', 'target': 'Norwegian', 'country': 'AU', 'choices': ['Maori', 'Mandarin', 'Norwegian', 'Tongan'], 'sample': '48f9c924e0d98c959d8a6f1862b3ce9a', 'date': '2013-08-19'},
{'guess': 'Dinka', 'target': 'Dinka', 'country': 'AU', 'choices': ['Danish', 'Dinka', 'Khmer', 'Lao'], 'sample': 'af5e8f27cef9e689a070b8814dcc02c3', 'date': '2013-08-19'},
{'guess': 'Turkish', 'target': 'Samoan', 'country': 'AU', 'choices': ['German', 'Hungarian', 'Samoan', 'Turkish'], 'sample': '509c36eb58dbce009ccf93f375358d53', 'date': '2013-08-19'},
{'guess': 'Latvian', 'target': 'Somali', 'country': 'AU', 'choices': ['Danish', 'Korean', 'Latvian', 'Somali'], 'sample': 'a505ab771ae7c32744ad31b3051b8ee9', 'date': '2013-08-19'},
{'guess': 'Japanese', 'target': 'Japanese', 'country': 'AU', 'choices': ['Bangla', 'Dinka', 'Italian', 'Japanese'], 'sample': '3569611136ea04bab18a0cd605ced358', 'date': '2013-08-19'},
{'guess': 'Maltese', 'target': 'Turkish', 'country': 'AU', 'choices': ['Hindi', 'Lao', 'Maltese', 'Turkish'], 'sample': 'af0e25c7637fb0dcdc56fac6d49aa55e', 'date': '2013-08-19'},
{'guess': 'French', 'target': 'French', 'country': 'AU', 'choices': ['Burmese', 'Danish', 'French', 'Swedish'], 'sample': '92f9e1c17e6df988780527341fdb471d', 'date': '2013-08-19'},
{'guess': 'German', 'target': 'German', 'country': 'AU', 'choices': ['German', 'Serbian', 'Swedish', 'Vietnamese'], 'sample': 'e77d97b712adffc39e531e20237a5589', 'date': '2013-08-19'},
{'guess': 'Spanish', 'target': 'Spanish', 'country': 'AU', 'choices': ['Amharic', 'Czech', 'Sinhalese', 'Spanish'], 'sample': 'dc3ace49393de518e87d4f8d3ae8d9db', 'date': '2013-08-19'},
{'guess': 'Romanian', 'target': 'Romanian', 'country': 'AU', 'choices': ['Estonian', 'Japanese', 'Lao', 'Romanian'], 'sample': '901fc45cba5245f21deaaca3966f825b', 'date': '2013-08-19'}]
#+END_SRC

#+RESULTS:

Validate the Json objects with the "validate" function (if no exceptions
are raised, the objects are valid).

#+BEGIN_SRC python :session valdidate_json :results output
for line in Records:
    validate(instance=line,schema=schema)
print ("Validation took place. No Error was found. The document is valid.")
#+END_SRC

#+RESULTS:
: Validation took place. No Error was found. The document is valid.

Consider now the object 

#+BEGIN_SRC python :session valdidate_json
obj={'guess': 'Dinka', 'target': 'Dinka', 
     'country': 'AU', 'choices': 'Dinka', 
     'sample': 'af5e8f27cef9e689a070b8814dcc02c3', 
     'date': '2013-08-19'}
#+END_SRC

#+RESULTS:

It is clear that choices above does not respect your validation schema
as that it is not an array.

In such a case we expect to observe an error

#+begin_src python :session valdidate_json :results output
validate(instance=obj,schema=schema)
#+end_src

#+RESULTS:
#+begin_example
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
  File "/Users/marcohassan/Desktop/python_venv/TreeSchutz/lib/python3.7/site-packages/jsonschema/validators.py", line 934, in validate
    raise error
jsonschema.exceptions.ValidationError: 'Dinka' is not of type 'array'

Failed validating 'type' in schema['properties']['choices']:
    {'items': {'type': 'string'}, 'type': 'array'}

On instance['choices']:
    'Dinka'
#+end_example

This is a very minimum example for json validation. For more
information on it google it. A good starting point is [[https://json-schema.org/understanding-json-schema/][this one]].

